Revit 2024 API
BuiltInFailures.DimensionFailures.CannotLockThisDimension Property
 Can't lock this Dimension because it breaks formulas
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotLockThisDimension { get; }
Visual Basic
Public Shared ReadOnly Property CannotLockThisDimension As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotLockThisDimension {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace